app/Http/Controllers/DataUserController.php

    public function index()
    {
        $data = User::all();
---
SELECT * FROM `users`