app/Http/Controllers/hsi2023Controller.php

    public function index()
    {
        $hsi2023s = Hsi2023::select('BULAN', 'TGL BAGI WO', 'STO', 'STATUS', 'KETERANGAN', 'MITRA', 'SEGMEN')->get();
---
SELECT `BULAN`, `TGL BAGI WO`, `STO`, `STATUS`, `KETERANGAN`, `MITRA`, `SEGMEN` FROM `hsi2023`